OpenFoam2/validation1rod/NoRad/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Inlet
    {
        type            patch;
        nFaces          1;
        startFace       9;
    }
    Outlet
    {
        type            patch;
        nFaces          1;
        startFace       10;
    }
    leftwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       11;
    }
    rigtwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       21;
    }
    Empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20;
        startFace       31;
    }
)

// ************************************************************************* //
