OpenFoam2/validation1rod/NoRad/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      p;
}


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    Inlet           { type totalPressure; p0 uniform  101325; gamma 1.4; value uniform 101325; }
    Outlet          { type zeroGradient;}
    ".*wall"        { type zeroGradient; }

}


// ************************************************************************* //
