OpenFoam2/validation1rod/NoRad/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes           { default steadyState; }

interpolationSchemes { default upwind phi; }

gradSchemes          { default Gauss upwind phi; }

snGradSchemes        { default corrected; }

laplacianSchemes     { default Gauss linear corrected; }

divSchemes           
{ 
      default      Gauss linear;
      div(phi,U)   bounded Gauss upwind;
}




// ************************************************************************* //
